kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C3</name>
      <description>I2C3 peripheral</description>
      <baseAddress>0xbf805000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>I2C3CON</name>
          <description>I2C3CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>4096</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3CONCLR</name>
          <description>I2C3CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3CONSET</name>
          <description>I2C3CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3CONINV</name>
          <description>I2C3CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3STAT</name>
          <description>I2C3STAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3STATCLR</name>
          <description>I2C3STATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3STATSET</name>
          <description>I2C3STATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3STATINV</name>
          <description>I2C3STATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3ADD</name>
          <description>I2C3ADD register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3ADDCLR</name>
          <description>I2C3ADDCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3ADDSET</name>
          <description>I2C3ADDSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3ADDINV</name>
          <description>I2C3ADDINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3MSK</name>
          <description>I2C3MSK register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3MSKCLR</name>
          <description>I2C3MSKCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3MSKSET</name>
          <description>I2C3MSKSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3MSKINV</name>
          <description>I2C3MSKINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3BRG</name>
          <description>I2C3BRG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3BRGCLR</name>
          <description>I2C3BRGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3BRGSET</name>
          <description>I2C3BRGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3BRGINV</name>
          <description>I2C3BRGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRN</name>
          <description>I2C3TRN register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRNCLR</name>
          <description>I2C3TRNCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRNSET</name>
          <description>I2C3TRNSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRNINV</name>
          <description>I2C3TRNINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3RCV</name>
          <description>I2C3RCV register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
