kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C5</name>
      <description>I2C5 peripheral</description>
      <baseAddress>0xbf805200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>I2C5CON</name>
          <description>I2C5CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>4096</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5CONCLR</name>
          <description>I2C5CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5CONSET</name>
          <description>I2C5CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5CONINV</name>
          <description>I2C5CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5STAT</name>
          <description>I2C5STAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5STATCLR</name>
          <description>I2C5STATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5STATSET</name>
          <description>I2C5STATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5STATINV</name>
          <description>I2C5STATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5ADD</name>
          <description>I2C5ADD register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5ADDCLR</name>
          <description>I2C5ADDCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5ADDSET</name>
          <description>I2C5ADDSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5ADDINV</name>
          <description>I2C5ADDINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5MSK</name>
          <description>I2C5MSK register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5MSKCLR</name>
          <description>I2C5MSKCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5MSKSET</name>
          <description>I2C5MSKSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5MSKINV</name>
          <description>I2C5MSKINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5BRG</name>
          <description>I2C5BRG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5BRGCLR</name>
          <description>I2C5BRGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5BRGSET</name>
          <description>I2C5BRGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5BRGINV</name>
          <description>I2C5BRGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5TRN</name>
          <description>I2C5TRN register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5TRNCLR</name>
          <description>I2C5TRNCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5TRNSET</name>
          <description>I2C5TRNSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5TRNINV</name>
          <description>I2C5TRNINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C5RCV</name>
          <description>I2C5RCV register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
