kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>ADC1BUF9</name>
          <description>ADC1BUF9 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF9</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFA</name>
          <description>ADC1BUFA register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFB</name>
          <description>ADC1BUFB register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFC</name>
          <description>ADC1BUFC register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFC</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFD</name>
          <description>ADC1BUFD register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFD</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFE</name>
          <description>ADC1BUFE register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFE</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFF</name>
          <description>ADC1BUFF register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CVR</name>
      <description>CVR peripheral</description>
      <baseAddress>0xbf809800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CVRCON</name>
          <description>CVRCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONCLR</name>
          <description>CVRCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONSET</name>
          <description>CVRCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONINV</name>
          <description>CVRCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
