kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CFG</name>
      <description>CFG peripheral</description>
      <baseAddress>0xbf80f200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDPCON</name>
          <description>DDPCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>8</resetValue>
          <fields>
            <field>
              <name>TDOEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TROEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>JTAGEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>DEVID register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEVID</name>
              <bitRange>[27:0]</bitRange>
            </field>
            <field>
              <name>VER</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEY</name>
          <description>SYSKEY register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEYCLR</name>
          <description>SYSKEYCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEYSET</name>
          <description>SYSKEYSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEYINV</name>
          <description>SYSKEYINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVM</name>
      <description>NVM peripheral</description>
      <baseAddress>0xbf80f400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>NVMCON</name>
          <description>NVMCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONCLR</name>
          <description>NVMCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONSET</name>
          <description>NVMCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONINV</name>
          <description>NVMCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <description>NVMKEY register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDR</name>
          <description>NVMADDR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRCLR</name>
          <description>NVMADDRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRSET</name>
          <description>NVMADDRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRINV</name>
          <description>NVMADDRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA</name>
          <description>NVMDATA register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADDR</name>
          <description>NVMSRCADDR register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMSRCADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
