kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>IFS0SET</name>
          <description>IFS0SET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0INV</name>
          <description>IFS0INV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1</name>
          <description>IFS1 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1CLR</name>
          <description>IFS1CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1SET</name>
          <description>IFS1SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1INV</name>
          <description>IFS1INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
