kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>IFS2</name>
          <description>IFS2 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2CLR</name>
          <description>IFS2CLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2SET</name>
          <description>IFS2SET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2INV</name>
          <description>IFS2INV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0</name>
          <description>IEC0 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0CLR</name>
          <description>IEC0CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0SET</name>
          <description>IEC0SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0INV</name>
          <description>IEC0INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
