kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>IEC1</name>
          <description>IEC1 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1CLR</name>
          <description>IEC1CLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1SET</name>
          <description>IEC1SET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1INV</name>
          <description>IEC1INV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2</name>
          <description>IEC2 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2CLR</name>
          <description>IEC2CLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2SET</name>
          <description>IEC2SET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2INV</name>
          <description>IEC2INV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U1BEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U1BRXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U1BTXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U2BEIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U2BRXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U2BTXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U3BEIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U3BRXIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U3BTXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0</name>
          <description>IPC0 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
