kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>IPC9INV</name>
          <description>IPC9INV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <description>IPC10 register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10CLR</name>
          <description>IPC10CLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10SET</name>
          <description>IPC10SET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10INV</name>
          <description>IPC10INV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11</name>
          <description>IPC11 register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCEIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11CLR</name>
          <description>IPC11CLR register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCEIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11SET</name>
          <description>IPC11SET register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCEIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11INV</name>
          <description>IPC11INV register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCEIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12</name>
          <description>IPC12 register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ETHIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12CLR</name>
          <description>IPC12CLR register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ETHIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12SET</name>
          <description>IPC12SET register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ETHIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12INV</name>
          <description>IPC12INV register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ETHIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
