kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>LATBCLR</name>
          <description>LATBCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATBSET</name>
          <description>LATBSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATBINV</name>
          <description>LATBINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCB</name>
          <description>ODCB register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCBCLR</name>
          <description>ODCBCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCBSET</name>
          <description>ODCBSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCBINV</name>
          <description>ODCBINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
