kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>LATDINV</name>
          <description>LATDINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCD</name>
          <description>ODCD register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDCLR</name>
          <description>ODCDCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDSET</name>
          <description>ODCDSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDINV</name>
          <description>ODCDINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
