kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>CNPUESET</name>
          <description>CNPUESET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNPUE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNPUE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNPUE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CNPUE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CNPUE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CNPUE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUEINV</name>
          <description>CNPUEINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNPUE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNPUE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNPUE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CNPUE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CNPUE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CNPUE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ETH</name>
      <description>ETH peripheral</description>
      <baseAddress>0xbf889000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x330</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ETHCON1</name>
          <description>ETHCON1 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUFCDEC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MANFC</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUTOFC</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RXEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXRTS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PTV</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON1CLR</name>
          <description>ETHCON1CLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUFCDEC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MANFC</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUTOFC</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RXEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXRTS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PTV</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON1SET</name>
          <description>ETHCON1SET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUFCDEC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MANFC</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUTOFC</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RXEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXRTS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PTV</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON1INV</name>
          <description>ETHCON1INV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUFCDEC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MANFC</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUTOFC</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RXEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXRTS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PTV</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON2</name>
          <description>ETHCON2 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUF_SZ</name>
              <bitRange>[10:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON2CLR</name>
          <description>ETHCON2CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUF_SZ</name>
              <bitRange>[10:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON2SET</name>
          <description>ETHCON2SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUF_SZ</name>
              <bitRange>[10:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHCON2INV</name>
          <description>ETHCON2INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUF_SZ</name>
              <bitRange>[10:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHTXST</name>
          <description>ETHTXST register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHTXSTCLR</name>
          <description>ETHTXSTCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHTXSTSET</name>
          <description>ETHTXSTSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHTXSTINV</name>
          <description>ETHTXSTINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXST</name>
          <description>ETHRXST register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXSTCLR</name>
          <description>ETHRXSTCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXSTSET</name>
          <description>ETHRXSTSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXSTINV</name>
          <description>ETHRXSTINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXSTADDR</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT0</name>
          <description>ETHHT0 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT0CLR</name>
          <description>ETHHT0CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT0SET</name>
          <description>ETHHT0SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT0INV</name>
          <description>ETHHT0INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT1</name>
          <description>ETHHT1 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT1CLR</name>
          <description>ETHHT1CLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT1SET</name>
          <description>ETHHT1SET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHHT1INV</name>
          <description>ETHHT1INV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM0</name>
          <description>ETHPMM0 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM0CLR</name>
          <description>ETHPMM0CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM0SET</name>
          <description>ETHPMM0SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM0INV</name>
          <description>ETHPMM0INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM1</name>
          <description>ETHPMM1 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM1CLR</name>
          <description>ETHPMM1CLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM1SET</name>
          <description>ETHPMM1SET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMM1INV</name>
          <description>ETHPMM1INV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMM</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMCS</name>
          <description>ETHPMCS register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMCS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMCSCLR</name>
          <description>ETHPMCSCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMCS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMCSSET</name>
          <description>ETHPMCSSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMCS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHPMCSINV</name>
          <description>ETHPMCSINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMCS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
