kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>EMAC1CFG2SET</name>
          <description>EMAC1CFG2SET register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FULLDPLX</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LENGTHCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HUGEFRM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DELAYCRC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRCENABLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PADENABLE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VLANPAD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOPAD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PUREPRE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LONGPRE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOBKOFF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BPNOBKOFF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EXCESSDFR</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG2INV</name>
          <description>EMAC1CFG2INV register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FULLDPLX</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LENGTHCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HUGEFRM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DELAYCRC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRCENABLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PADENABLE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VLANPAD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOPAD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PUREPRE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LONGPRE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOBKOFF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BPNOBKOFF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EXCESSDFR</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGT</name>
          <description>EMAC1IPGT register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>18</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGTCLR</name>
          <description>EMAC1IPGTCLR register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGTSET</name>
          <description>EMAC1IPGTSET register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGTINV</name>
          <description>EMAC1IPGTINV register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGR</name>
          <description>EMAC1IPGR register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>3090</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGRCLR</name>
          <description>EMAC1IPGRCLR register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGRSET</name>
          <description>EMAC1IPGRSET register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGRINV</name>
          <description>EMAC1IPGRINV register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRT</name>
          <description>EMAC1CLRT register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>14095</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRTCLR</name>
          <description>EMAC1CLRTCLR register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRTSET</name>
          <description>EMAC1CLRTSET register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRTINV</name>
          <description>EMAC1CLRTINV register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXF</name>
          <description>EMAC1MAXF register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>1518</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXFCLR</name>
          <description>EMAC1MAXFCLR register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXFSET</name>
          <description>EMAC1MAXFSET register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXFINV</name>
          <description>EMAC1MAXFINV register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPP</name>
          <description>EMAC1SUPP register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>4096</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPPCLR</name>
          <description>EMAC1SUPPCLR register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPPSET</name>
          <description>EMAC1SUPPSET register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPPINV</name>
          <description>EMAC1SUPPINV register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TEST</name>
          <description>EMAC1TEST register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TESTCLR</name>
          <description>EMAC1TESTCLR register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TESTSET</name>
          <description>EMAC1TESTSET register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TESTINV</name>
          <description>EMAC1TESTINV register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFG</name>
          <description>EMAC1MCFG register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>32</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFGCLR</name>
          <description>EMAC1MCFGCLR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFGSET</name>
          <description>EMAC1MCFGSET register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFGINV</name>
          <description>EMAC1MCFGINV register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMD</name>
          <description>EMAC1MCMD register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMDCLR</name>
          <description>EMAC1MCMDCLR register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMDSET</name>
          <description>EMAC1MCMDSET register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMDINV</name>
          <description>EMAC1MCMDINV register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADR</name>
          <description>EMAC1MADR register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>256</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADRCLR</name>
          <description>EMAC1MADRCLR register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADRSET</name>
          <description>EMAC1MADRSET register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADRINV</name>
          <description>EMAC1MADRINV register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTD</name>
          <description>EMAC1MWTD register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTDCLR</name>
          <description>EMAC1MWTDCLR register</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTDSET</name>
          <description>EMAC1MWTDSET register</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
