kiffie/edc2svd/ci/regtest/PIC32MX695F512L.svd
        <register>
          <name>EMAC1MWTDINV</name>
          <description>EMAC1MWTDINV register</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDD</name>
          <description>EMAC1MRDD register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDDCLR</name>
          <description>EMAC1MRDDCLR register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDDSET</name>
          <description>EMAC1MRDDSET register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDDINV</name>
          <description>EMAC1MRDDINV register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MIND</name>
          <description>EMAC1MIND register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MINDCLR</name>
          <description>EMAC1MINDCLR register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MINDSET</name>
          <description>EMAC1MINDSET register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MINDINV</name>
          <description>EMAC1MINDINV register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0</name>
          <description>EMAC1SA0 register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0CLR</name>
          <description>EMAC1SA0CLR register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0SET</name>
          <description>EMAC1SA0SET register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0INV</name>
          <description>EMAC1SA0INV register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1</name>
          <description>EMAC1SA1 register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1CLR</name>
          <description>EMAC1SA1CLR register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1SET</name>
          <description>EMAC1SA1SET register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1INV</name>
          <description>EMAC1SA1INV register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2</name>
          <description>EMAC1SA2 register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2CLR</name>
          <description>EMAC1SA2CLR register</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2SET</name>
          <description>EMAC1SA2SET register</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2INV</name>
          <description>EMAC1SA2INV register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>